Revit 2027 API
NurbsSurfaceData.GetNumberOfWeights Method
 Get the number of weights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfWeights()
Public Function GetNumberOfWeights As Integer
public:
int GetNumberOfWeights()
member GetNumberOfWeights : unit -> int
Return Value
Int32
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace